# TODO: С помощью цикла создать массив из 30 элементов с случайными числами от 1 до 100

# import random
#
# a = 30
# a2 = []
#
# while a > 0:
#     a2.append(random.randint(1, 100))
#     a -= 1
# print(a2)

# TODO: создать список обьектов пользователей с именем и возрастом, и с помозью цикла вывести в коносоль информацию пользователей




# TODO: Напишите программу, в которой в бексонечном цикле пользователь вводит два числа, а программа выводит их сумму.
# Затем программа запрашивает, надо ли завершить ввод. И если пользователь вводит букву "Y" или "y",
# то происходит выход из бесконечного цикла, и программа завершается. При нажатии любой другой клавиши, программа продолжает работу



# result = [
#     {
#         "param": "t",
#         "value": 30
#     },
#     {
#         "param": "v",
#         "value": 15
#     },
#     {
#         "param": "c",
#         "value": 10
#     }
# ]