# name = input("Имя")
# TODO: Спросить имя и возраст пользователя, если больше 18 лет - то пишешь "ок". Если < 18, то "{ИМЯ} вы слишком малы!


# a1 = input("Введите имя: ")
# a2 = int(input("Возраст"))
#
# if a1 and a2 >= 18:
#
#     print("Ок")
#
# else:
#     print(a1 + ",Вы слишком малы!")

# # TODO: Напишите программу, в которую пользователь вводит два числа, а программа выводит сообщение, какое из чисел больше.
# a1 = int(input("Введите число 1:"))
# a2 = int(input("Введите число 2:"))
#
# if a1 > a2:
#     print("Число " + str(a1) + " больше числа " + str(a2) )
# elif a1 < a2:
#     print("Число " + str(a2) + " больше числа " + str(a1) )
# elif a1 == a2:
#     print("Числа равны")


# TODO: Напишиите программу, которая вычисляет сумму скидки в зависимости от суммы продажи. Спросить сумму: если > 5000 то скидка 10%

# a1 = float(input("Введите сумму покупки:"))
# a2 = float(0.1)
# a3 = a1 * a2
# a4 = a1 - a3
# a5 = 5000 - a1
# if a1 > 5000:
#     print("Сумма вашей скидки составляет: " + str(a3) + "рублей")
#     print("Стоимость покупки составляет: " + str(a4) + "рублей")
# else:
#     print("Cумма покупки меньше заданной, скидка недоступна. Нехватает " + str(a5) + "рублей" )

#TODO: Дана строка. Если в этой строке более одного символа, выведите в консоль предпоследний символ этой строки.

# a1 = input("введи текст:")
# a2 = len(a1)
# if a2 > 1:
#     print("Длинна строки: " + str(a2) + " ,предпоследний символ: " + a1[-2])
# else:
#     print("Короткая строка!")

